using System.Collections;
using UnityEngine;

namespace Suburb.Mars
{
    public class InteractionService
    {
        // надо подумать какую архитектуру выбрать для проекта
        // этот сервис пока что должен отвечать за некоторые возможности которые предлагает нам игра
        // во первых и самое главное, это загрузка карты, загрузка персонажа, загрузка ракеты
        // персонаж должен загружать в себя и подцепляться с системе управления
        // только персонаж это только часть игры и получается все что возможно нам вовсе и не нужно, чтобы
        // была какая то прямая связь между системой управления и обьектами на карте, вполне возможно что у нас будет принцип
        // у нас будет принцип мы касаемся чего то на карте, оно реагирует, но и тут не все так просто
        // нужно рисовать
    }
}